## 누락 데이터 확인

In [2]:
import seaborn as sns
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.info()
#deck=891-203=688개의 누락데이터가 존재

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
nan_deck=df['deck'].value_counts(dropna=False)
print(nan_deck)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [5]:
## 누락 데이터를 찾는 직접적인 방법
##isnull(): deck 열의 0행에 있는 원소는 true 값이므로 누락 데이터
##notnull()
print(df.head().isnull)

<bound method DataFrame.isnull of    survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True  >

In [6]:
#deck 열의 0행에 위치한 원소는 false를 갖기 때문에 누락 데이터
print(df.head().notnull)

<bound method DataFrame.notnull of    survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True  >

In [7]:
print(df.head().isnull().sum(axis=0))
#deck 누락 3개

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [8]:
import seaborn as sns

df=sns.load_dataset('titanic')

#for 반복문으로 각 열의 NAN 개수 계산하기
missing_df=df.isnull()
for col in missing_df.columns:
    missing_count=missing_df[col].value_counts() #각 열의 NAN 개수 파악
    try:
        print(col, ':', missing_count[True])
    except:
        print(col, ':', 0)

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [10]:
# NaN 값이 500개 이상인 열을 모두 삭제-deck 열(891개 중 688개의 NaN 값)
df_thresh=df.dropna(axis=1, thresh=500)
print(df_thresh.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [12]:
# age 열에 나이 데이터가 없는 모든 행 삭제-age 열 (891개 중 177개의 NaN값)
# how='any': NaN 값이 하나라도 존재하면 삭제한다는 뜻
# axis=0 : 모든 행
# subset을 age열로 한정 시킴
df_age=df.dropna(subset=['age'], how='any', axis=0)
print(len(df_age))
#drop 후 남은 714개의 행을 df_age에 저장

714

In [13]:
## 누락데이터 치환

In [14]:
import seaborn as sns
df=sns.load_dataset('titanic')
#age 열의 첫 10개 데이터 출력(5행에 NaN 값)
print(df['age'].head(10))
print('\n')

#age 열의 NaN값을 다른 나이 데이터의 평균으로 변경하기
mean_age=df['age'].mean(axis=0) #age 열의 평균 계산
df['age'].fillna(mean_age, inplace=True)

#age 열의 첫 10개의 데이터 출력(5행에 NaN 값이 평균으로 대체)
print(df['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64


0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [17]:
import seaborn as sns
df=sns.load_dataset('titanic')

#embark_town 열의 829행의 NaN 데이터 출력
print(df['embark_town'][825:830])
#825-829 행들을 통해 829 NaN 확인
print('\n')

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [19]:
#embark_town 열의 NaN 값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
#idmax():가장 큰 값을 갖는 도시를 찾는다.
#829행의 NaN 값을 포함해서 누락 데이터들은 Southampton으로 변경
most_freq=df['embark_town'].value_counts(dropna=True).idxmax()
print(most_freq)

Southampton

In [20]:
df['embark_town'].fillna(most_freq, inplace=True)

#embark_town 열 829행의 NaN데이터 출력(NaN값이 most_freq 값으로 대체)
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [21]:
df=sns.load_dataset('titanic')
print(df['embark_town'][825:830])

#embark_town 열의 NaN 값을 바로 옆에 있는 828행의 값으로 변경하기
#method='ffill': NaN이 있는 행의 직전 행에 있는 값으로 바꿈
#method='bfill': NaN이 있는 행의 바로 다음 행에 있는 값을 가지고 치환
df['embark_town'].fillna(method='ffill', inplace=True)
print(df['embark_town'][825:830])
#바로 앞의 Queenstown 으로 치환됨

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object
825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [22]:
import pandas as pd
df=pd.DataFrame({'c1':['a','a','b','a','b'],
                 'c2':[1,1,1,2,2,],
                 'c3':[1,1,2,2,2]
                 })
print(df)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [24]:
#df 전체 행에서 중복값 찾기
df_dup=df.duplicated()
print(df_dup)

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [25]:
# df 특정 열에서의 중복값
col_dup=df['c2'].duplicated()
print(col_dup)

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [26]:
## 중복데이터 제거
import pandas as pd
df=pd.DataFrame({'c1':['a','a','b','a','b'],
                 'c2':[1,1,1,2,2,],
                 'c3':[1,1,2,2,2]
                 })
print(df)

# df 중복행 제거
df2=df.drop_duplicates()
print(df2)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [27]:
#c2, c3 열을 기준으로 중복행 제거
df3=df.drop_duplicates(subset=['c2','c3'])
print(df3)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2